
## :white_check_mark: Apply Succeeded (account-data-deleter-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/30536)



<pre><code>Apply complete! Resources: 2 added, 2 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Reading...
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Reading...
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical]
aws_ecs_cluster.data-deleter-app_application_ecs_cluster_72BD4946: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/AccountDataDeleter-Prod]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Reading...
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Reading...
aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Read complete after 0s [id=4250039221]
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Read complete after 0s [id=1349007126]
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Reading...
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Processed_dynamodb_table_889BF31E: Refreshing state... [id=ADD-HistoricalDeletedUsers-Processed]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Reading...
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Read complete after 0s [id=2591764522]
data.terraform_remote_state.incident_management: Read complete after 0s
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Read complete after 0s [id=/Shared/Vpc]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Pending_dynamodb_table_225C7A6D: Refreshing state... [id=ADD-HistoricalDeletedUsers-Pending]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Reading...
aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/f6571689-cb7b-491c-878b-e3f64918d69f]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Read complete after 0s [id=4250039221]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical]
aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31: Refreshing state... [id=/Backend/AccountDataDeleter-Prod/ecs/app]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Read complete after 0s [id=/AccountDataDeleter/Prod/SENTRY_DSN]
aws_codedeploy_app.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-app_F69B4EF8: Refreshing state... [id=932b566b-77b2-4ba3-9500-bddb06d2a92f:AccountDataDeleter-Prod-BatchDeleteLambda-Lambda]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Reading...
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Reading...
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Read complete after 0s [id=2591764522]
data.aws_region.region: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
aws_cloudwatch_event_rule.batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-rule_2852CA7A: Refreshing state... [id=AccountDataDeleter-Prod-BatchDelete-Lambda-Trigger-Rule]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Read complete after 1s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Read complete after 1s [id=1349007126]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Read complete after 1s [id=/AccountDataDeleter/CircleCI/Prod/SERVICE_HASH]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_codedeploy_app.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_3F6E9850: Refreshing state... [id=c103436b-3d9b-4895-b26d-74c1a061ae60:AccountDataDeleter-Prod-ECS]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Reading...
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Reading...
data.aws_kms_alias.kms_alias: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834: Refreshing state... [id=Z06690021XQYR4BI9JDYG]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Reading...
aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue-Deadletter]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_codedeploy_app.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-app_8782CBBF: Refreshing state... [id=4d105cf4-2112-43e8-bc8a-ce92b7319b2c:AccountDataDeleter-Prod-Sqs-Event-Consumer-Lambda]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Read complete after 0s [id=/AccountDataDeleter/CircleCI/Prod/SERVICE_HASH]
aws_ecr_repository.data-deleter-app_application_ecs_service_ecr-app_ecr-repo_3026A62A: Refreshing state... [id=accountdatadeleter-prod-app]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue]
aws_iam_role.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-role_9D02E0E0: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-CodeDeployRole]
aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Read complete after 0s [id=/AccountDataDeleter/Prod/SENTRY_DSN]
aws_iam_policy.event-consumer_sqs-event-consumer_lambda_execution-policy_99388433: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P1DTPJ3]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P5PEQYT]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Reading...
aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C: Refreshing state... [id=AccountDataDeleter-Prod-ECSCodeDeployRole]
aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role_91290640: Refreshing state... [id=AccountDataDeleter-Prod-TaskRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-execution-role_A0A8D414: Refreshing state... [id=AccountDataDeleter-Prod-TaskExecutionRole]
aws_iam_policy.batchdeletelambda_batch-delete-lambda_execution-policy_0CB4B8C7: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRolePolicy]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Read complete after 0s [id=Z2BHWTOWFVNW3M]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Reading...
aws_iam_role.batchdeletelambda_batch-delete-lambda_execution-role_28D715FA: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRole]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Read complete after 0s [id=2476603294]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Read complete after 0s [id=3315687287]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Reading...
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda]
aws_s3_bucket_public_access_block.batchdeletelambda_batch-delete-lambda_code-bucket-public-access-block_1A938E94: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Read complete after 0s [id=3224986813]
aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue]
aws_codestarnotifications_notification_rule.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_415EAA02: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/7dcf7784d5929c8bdd5fe74f0687f3cbe3effb71]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Read complete after 0s [id=2158747704]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Reading...
aws_sns_topic_subscription.event-consumer_user-events-sns-subscription_164DD4AB: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:0596861b-c5e2-4e1b-9e9c-9b307942df34]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Read complete after 0s [id=2157617092]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Read complete after 0s [id=vpc-867638e3]
aws_ecr_lifecycle_policy.data-deleter-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_0035C10E: Refreshing state... [id=accountdatadeleter-prod-app]
aws_route53_record.data-deleter-app_application_alb_certificate_certificate_record_88681242: Refreshing state... [id=Z06690021XQYR4BI9JDYG__ab448b998cae9a513fb845474d05e73b.account-data-deleter-api.readitlater.com._CNAME]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-policy-attachment_70043CD9: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-CodeDeployRole-20221114213608362400000001]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P3BGIIS]
aws_codedeploy_deployment_group.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deployment-group_C5F30D1B: Refreshing state... [id=b905833b-81c6-45cc-972a-33e018dd862b]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PILEIT9]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=P02VI62]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P7O4JXF]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_C5DC6D5A: Refreshing state... [id=AccountDataDeleter-Prod-ECSCodeDeployRole-2022060219383140510000000a]
aws_route53_record.data-deleter-app_application_base_dns_subhosted_zone_ns_D71A4B22: Refreshing state... [id=Z2BHWTOWFVNW3M_account-data-deleter-api.readitlater.com_NS]
aws_s3_bucket_public_access_block.event-consumer_sqs-event-consumer_lambda_code-bucket-public-access-block_AF8F837A: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
aws_codedeploy_deployment_group.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deployment-group_25E98995: Refreshing state... [id=703ee45b-4678-4238-bd8b-6a21d913a1b0]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_DAFAA787: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole-20220602224300268900000002]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda_execution-role-policy-attachment_8D0214D0: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole-20220602224300238700000001]
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_B4FDF02D: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-TaskExecutionRolePolicy]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ]
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue]
aws_iam_policy.event-consumer_sqs-event-consumer_sqs-policy_F429D868: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-Sqs-Event-Consumer-LambdaSQSPolicy]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Read complete after 0s [id=4193749989]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_internal_security_groups_49C5949A: Reading...
aws_alb_target_group.data-deleter-app_application_ecs_service_green_target_group_ecs_target_group_2F7CE961: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ADDgre20220602193822338100000005/a23eb0fe81425bea]
data.aws_subnets.data-deleter-app_application_pocket_vpc_public_subnet_ids_020D43E9: Reading...
data.aws_subnets.data-deleter-app_application_pocket_vpc_private_subnet_ids_47C2CFCD: Reading...
data.aws_security_groups.data-deleter-app_application_pocket_vpc_default_security_groups_A20BE21F: Reading...
aws_alb_target_group.data-deleter-app_application_ecs_service_blue_target_group_ecs_target_group_283B74DF: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ADDblu20220602193822579700000007/d59c4de1e69e4d90]
data.aws_subnets.data-deleter-app_application_pocket_vpc_private_subnet_ids_47C2CFCD: Read complete after 0s [id=us-east-1]
data.aws_subnets.data-deleter-app_application_pocket_vpc_public_subnet_ids_020D43E9: Read complete after 0s [id=us-east-1]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_internal_security_groups_49C5949A: Read complete after 0s [id=us-east-1]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_default_security_groups_A20BE21F: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_1BBB86C3: Refreshing state... [id=AccountDataDeleter-Prod-TaskExecutionRole-2022060219383271900000000d]
aws_security_group.data-deleter-app_application_application_load_balancer_alb_security_group_D3CF9597: Refreshing state... [id=sg-040d071fa04ee63d0]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Refreshing state... [id=AccountDataDeleter-Prod]
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda,private]
aws_iam_policy.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy_D7410D4B: Refreshing state... [id=arn:aws:iam::996905175585:policy/batchDeleteLambda-BatchDeleteLambda-DynamoLambdaPolicy]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_execution-role-policy-attachment_2D695129: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRole-20221114213608380600000002]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical:a2574e75-ed5c-4dee-9a28-a9dec83655f6]
aws_acm_certificate_validation.data-deleter-app_application_alb_certificate_certificate_validation_3E5D39F1: Refreshing state... [id=2022-06-02 19:39:16.72 +0000 UTC]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer,private]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role-policy_0A0BC3A4: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-TaskRolePolicy]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_AAC29FFD: Refreshing state... [id=AccountDataDeleter-Prod-TaskExecutionRole-2022060219383265290000000c]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_execution-role-policy-attachment_64A8236E: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole-20220602224350312500000003]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical:1aa392e1-40a6-477b-bbe0-d3bc3b71c05d]
aws_security_group.data-deleter-app_application_ecs_service_ecs_security_group_8AA7466D: Refreshing state... [id=sg-0f2d0f524792d876a]
aws_alb.data-deleter-app_application_application_load_balancer_alb_1E12FF35: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ADD2022060219383277340000000e/056efebb82a27907]
aws_iam_role_policy_attachment.batchdeletelambda_BatchDeleteLambda-execution-role-policy-attachment_C22EB886: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRole-20221114213617981700000003]
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Refreshing state... [id=7b313ef990ab83caa5369c21065877067f3186b0]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-Function]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-custom-attachment_588622C1: Refreshing state... [id=AccountDataDeleter-Prod-TaskRole-2022060219383260910000000b]
aws_alb_listener.data-deleter-app_application_listener_http_55B9BA83: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ADD2022060219383277340000000e/056efebb82a27907/c54976348a9a8721]
aws_alb_listener.data-deleter-app_application_listener_https_634EB75E: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ADD2022060219383277340000000e/056efebb82a27907/7de2045154779f08]
aws_route53_record.data-deleter-app_application_alb_record_3941D2F4: Refreshing state... [id=Z06690021XQYR4BI9JDYG_account-data-deleter-api.readitlater.com_A_1]
aws_cloudwatch_metric_alarm.data-deleter-app_application_alarm-httptarget5xxerrorrate_6FC46278: Refreshing state... [id=AccountDataDeleter-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_cloudwatch_log_group.event-consumer_sqs-event-consumer_lambda_log-group_970CA206: Refreshing state... [id=/aws/lambda/AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]
aws_lambda_alias.event-consumer_sqs-event-consumer_lambda_alias_7FEF0048: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:DEPLOYED]
aws_lambda_event_source_mapping.event-consumer_sqs-event-consumer_lambda_event_source_mapping_DFCB2350: Refreshing state... [id=4beb5222-030f-45f4-b5a3-68b4708b7b6b]
aws_lambda_permission.batchdeletelambda_AccountDataDeleter-Prod-batchLambda-permission_E53768B8: Refreshing state... [id=terraform-20221128205402590800000001]
aws_cloudwatch_log_group.batchdeletelambda_batch-delete-lambda_log-group_733861E0: Refreshing state... [id=/aws/lambda/AccountDataDeleter-Prod-BatchDeleteLambda-Function]
aws_cloudwatch_event_target.batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-target-AccountDataDeleter-Prod-BatchDeleteLambda-Rule-Target_AEC3C4E8: Refreshing state... [id=AccountDataDeleter-Prod-BatchDelete-Lambda-Trigger-Rule-AccountDataDeleter-Prod-BatchDeleteLambda-Rule-Target]
aws_lambda_alias.batchdeletelambda_batch-delete-lambda_alias_614E64AB: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:DEPLOYED]
aws_alb_listener_rule.data-deleter-app_application_ecs_service_listener_rule_1E84FFF2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/ADD2022060219383277340000000e/056efebb82a27907/7de2045154779f08/e87bdfee5695d6a3]
aws_ecs_service.data-deleter-app_application_ecs_service_ecs-service_CE3A63CF: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/AccountDataDeleter-Prod/AccountDataDeleter-Prod]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Refreshing state... [id=AccountDataDeleter-Prod]
aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938: Refreshing state... [id=service/AccountDataDeleter-Prod/AccountDataDeleter-Prod]
aws_codedeploy_deployment_group.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_84B5DC1D: Refreshing state... [id=8b58378e-1512-41fc-94f6-98c51dae5c5c]
aws_appautoscaling_policy.data-deleter-app_application_autoscaling_scale_in_policy_89E88BDA: Refreshing state... [id=AccountDataDeleter-Prod-ScaleInPolicy]
aws_appautoscaling_policy.data-deleter-app_application_autoscaling_scale_out_policy_B4560602: Refreshing state... [id=AccountDataDeleter-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_in_alarm_E6DFF327: Refreshing state... [id=AccountDataDeleter-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_out_alarm_ECA6EBEC: Refreshing state... [id=AccountDataDeleter-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07 must be replaced
-/+ resource "aws_ecs_task_definition" "data-deleter-app_application_ecs_service_ecs-task_243DED07" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:409" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/accountdatadeleter-prod-app:7c48997ee69de530e1a0dc8f9682ab78affc0b97" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/accountdatadeleter-prod-app:b5b1f141f2c8ada16bb029e4ea16bb2e17f03cb7"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "AccountDataDeleter-Prod" -> (known after apply)
      ~ revision                 = 409 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B will be updated in-place
  ~ resource "aws_lambda_function" "batchdeletelambda_batch-delete-lambda_9A38729B" {
        id                             = "AccountDataDeleter-Prod-BatchDeleteLambda-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:311" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:311/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "311" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"     = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C will be updated in-place
  ~ resource "aws_lambda_function" "event-consumer_sqs-event-consumer_lambda_2F35855C" {
        id                             = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:544" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:544/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "544" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                      = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09 will be created
  + resource "local_file" "data-deleter-app_application_ecs_service_appspec_5FC42C09" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destroying... [id=AccountDataDeleter-Prod]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destruction complete after 0s
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifying... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifying... [id=AccountDataDeleter-Prod-BatchDeleteLambda-Function]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creating...
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creation complete after 0s [id=AccountDataDeleter-Prod]
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creating...
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creation complete after 0s [id=8ebaadb7a7d89e1e71d360e3bd3c8a6a5429648e]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifications complete after 9s [id=AccountDataDeleter-Prod-BatchDeleteLambda-Function]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifications complete after 9s [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]

Apply complete! Resources: 2 added, 2 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"1d5b9399-93f6-43df-8861-f184f37f633f","JobName":"account-data-deleter_infrastructure_apply_prod","PRNumber":108,"Program":"tfcmt","SHA1":"b5b1f141f2c8ada16bb029e4ea16bb2e17f03cb7","Target":"account-data-deleter-cdk","Vars":{}} -->